In [1]:
import numpy as np
import pandas as pd

# 数据读取与预览

In [2]:
teacher = pd.read_csv('./education_data/1_teacher.csv')
student_info = pd.read_csv('./education_data/2_student_info.csv')
kaoqin = pd.read_csv('./education_data/3_kaoqin.csv')
kaoqintype = pd.read_csv('./education_data/4_kaoqintype.csv')
chengji = pd.read_csv('./education_data/5_chengji.csv')
exam_type = pd.read_csv('./education_data/6_exam_type.csv') 
consumption = pd.read_csv('./education_data/7_consumption.csv')

In [3]:
teacher.head()

          term  cla_id cla_Name gra_Name  sub_id sub_Name  bas_id bas_Name
0  2014-2015-1     708   高二(02)       高二       1       语文     224      徐老师
1  2014-2015-1     708   高二(02)       高二       2       数学      94      张老师
2  2014-2015-1     708   高二(02)       高二       3       英语     134      张老师
3  2014-2015-1     708   高二(02)       高二       4       物理     151      陈老师
4  2014-2015-1     708   高二(02)       高二       6       生物     253      史老师

In [5]:
teacher.shape

(3088, 8)

In [9]:
student_info.head()

,bf_StudentID,bf_Name,bf_sex,bf_nation,bf_BornDate,cla_Name,bf_NativePlace,Bf_ResidenceType,bf_policy,cla_id,cla_term,bf_zhusu,bf_leaveSchool,bf_qinshihao
0,14454,陈某某,女,汉族,2001.0,白-高二(01),宁波,城镇,共青团员,901,2018-2019-1,NaN,NaN,NaN
1,14479,曹某某,男,汉族,NaN,白-高二(01),NaN,城镇,共青团员,901,2018-2019-1,1.0,NaN,315.0
2,14486,金某某,男,汉族,NaN,白-高二(01),NaN,城镇,共青团员,901,2018-2019-1,1.0,NaN,321.0
3,14549,张某某,女,汉族,2002.0,白-高二(07),浙江平湖,城镇,共青团员,907,2018-2019-1,NaN,NaN,NaN
4,14550,张某某,女,汉族,2001.0,白-高二(04),浙江宁波,城镇,共青团员,904,2018-2019-1,NaN,NaN,NaN

In [10]:
student_info.shape

(1765, 14)

In [11]:
kaoqin.head()

,kaoqing_id,qj_term,DataDateTime,ControllerID,controler_name,control_task_order_id,bf_studentID,bf_Name,cla_Name,bf_classid
0,134324,2017-2018-1,2018/1/27 12:21:32,99003,早退[移动考勤机],9900300,13893,陈某某,高三(11),872
1,134346,2017-2018-1,2018/1/27 12:41:44,99003,早退[移动考勤机],9900300,13667,宋某某,高三(11),872
2,134367,2017-2018-1,2018/1/27 14:13:37,99003,早退[移动考勤机],9900300,13925,李某某,高三(09),879
3,134263,2017-2018-1,2018/1/27 11:18:03,99003,早退[移动考勤机],9900300,13774,张某某,高三(09),879
4,134480,2017-2018-1,2018/1/27 14:42:03,99002,校服[移动考勤机],9900200,13774,张某某,高三(09),879

In [12]:
kaoqin.shape

(23630, 10)

In [13]:
kaoqintype.head()

   controler_id controler_name  control_task_order_id control_task_name
0          1001          迟到_晚到                 100000              默认信息
1          1001          迟到_晚到                 100100              早上迟到
2          1001          迟到_晚到                 100200              晚到学校
3          1001          迟到_晚到                 100300             晚自修迟到
4          1002          校徽_早退                 200000              默认信息

In [14]:
kaoqintype.shape

(15, 4)

In [15]:
chengji.head()

,mes_TestID,exam_number,exam_numname,mes_sub_id,mes_sub_name,exam_term,exam_type,exam_sdate,mes_StudentID,mes_Score,mes_Z_Score,mes_T_Score,mes_dengdi
0,136424,282,2017年9月宁波市“十校联考”,17.0,政治,2017-2018-1,7,2017/9/20 00:00:00,13539,-2.0,NaN,NaN,NaN
1,136424,282,2017年9月宁波市“十校联考”,17.0,政治,2017-2018-1,7,2017/9/20 00:00:00,13548,90.0,1.074511,88.59608,0.137615
2,136424,282,2017年9月宁波市“十校联考”,17.0,政治,2017-2018-1,7,2017/9/20 00:00:00,13551,91.0,1.194145,89.55315,0.091743
3,136424,282,2017年9月宁波市“十校联考”,17.0,政治,2017-2018-1,7,2017/9/20 00:00:00,13555,-2.0,NaN,NaN,NaN
4,136424,282,2017年9月宁波市“十校联考”,17.0,政治,2017-2018-1,7,2017/9/20 00:00:00,13559,-2.0,NaN,NaN,NaN

In [16]:
chengji.shape

(471686, 13)

In [17]:
exam_type.head()

   EXAM_KIND_ID EXAM_KIND_NAME
0             2             期中
1             3             期末
2             4        平时(总评用)
3             5             总评
4             6           五校联考

In [18]:
exam_type.shape

(21, 2)

In [19]:
consumption.head()

            DealTime  MonDeal  bf_StudentID AccName PerSex
0  2018/7/1 06:32:51     -4.5         14877     张某某      女
1  2018/7/1 11:43:05    -11.0         14917     高某某      男
2  2018/7/1 14:21:42     -9.2         14921     胡某某      男
3  2018/7/1 14:33:06     -6.9         14898     牛某某      男
4  2018/7/1 15:05:45     -7.0         14917     高某某      男

In [20]:
consumption.shape

(463904, 5)